/* vbiPpcArch.h - PowerPC architecture specific definitions */

/*
 * Copyright (c) 2008-2013 Wind River Systems, Inc.
 *
 * The right to copy, distribute, modify or otherwise make use
 * of this software may be licensed only pursuant to the terms
 * of an applicable Wind River license agreement.
 */

/*
modification history
--------------------
01v,06jun12,kk   added back the use of VBI_PPC_E500MC (WIND00420036)
01u,04dec12,jpb  Added VSB option for PISA_EHV
01t,04apr11,jlv  Sync with HV 1.3 01-Apr-11(WIND00265419)
01s,08feb11,jlv  Sync with HV 1.3 04-Feb-11 DVD
01r,12jun10,rab  save and restore r3-r7 in VBI_INT_VCORE_PEND_CHECK
01q, 3mar10,rgo  Sync with HV1.2 view on 3/3/10
01p,24feb10,rgo  Introduce guestOS inline wrhvAmpCpuHreg32Set.
01o,25jan09,to   add VIRT_TO_PHYS_CPU_NUM to mdio messages
01n,02nov09,to   e500mc support
01m,07oct09,d_c  Defect WIND00185185 Fix WIND00185188 - Fix apigen errors
01l,21sep09,d_c  Defect WIND00183017 Fix WIND00183019 - sync with 18-Sep HV
                 DVD
01k,12aug09,d_c  Sync with HV 1.1 14-Aug-09 DVD, HV 1.1 version 01r
01j,16jul09,d_c  Fix bug in VBI_INT_VCORE_UNLOCK
01i,13jul09,to   fix comment of int locking macro
01h,01jul09,to   import vbiPpcArch.h, v01l from HV 1.1
01g,26may09,md   adapted for VxWorks 6.7
01f,14may09,pmr  WIND00166320 - fix MSR macro
01e,21apr09,rec  WIND00160134 - documentation updates
01d,09apr09,pmr  CQ144306: GuestOS MSR
01c,28jan09,dtr  Use new structures.
01b,23jan09,mmi  add debug registers

* by a guest running on hypervisor to configure the virtual CPU register.
*
* SYNOPSIS
*
* PPC Control structure graphical illustration
*\cs
*        _______________   
*       |       PC      |   
*       |---------------|
*       |       MSR     |	    
*       |---------------|
*       |       CR      |
*       |---------------|
*       |		|
*       |general purpose|
*       |     r[0:13]   | 
*       |		|
*       |---------------|
*       |emulated MSR   |
*       |---------------|
*       |       dbsr    |
*       |---------------|
*       | dbcr[0:2]     |
*       |---------------|
*       |IAC[1:2]       |
*       |---------------|
*       |DAC[1:2]       |
*       |---------------|
*       |reserved[0:9]  |
*       |---------------|
*
*\ce
*
* Virtual core's control C data structure type definition
*
*\cs
* VB_STATUS structure definition
*
* typedef struct vbArchControlRegs
*    {
*
*    /@ Registers to be restored by the VDK_SYS_ctx_load fast system call   @/
*
*    uint32_t srr0;	/@  0: PC		    @/
*    uint32_t srr1;	/@  1: MSR		    @/
*    uint32_t cr;	/@  2: condition registers	    @/
*    uint32_t r0;	/@  3: General register R0	    @/
*    uint32_t sp;	/@  4: General register R1 (stack pointer)  @/
*    uint32_t r2;	/@  5: General register R2	    @/
*    uint32_t r3;	/@  6: General register R3	    @/
*    uint32_t r4;	/@  7: General register R4	    @/
*    uint32_t r5;	/@  8: General register R5	    @/
*    uint32_t r6;	/@  9: General register R6	    @/
*    uint32_t r7;	/@ 10: General register R7	    @/
*    uint32_t r8;	/@ 11: General register R8	    @/
*    uint32_t r9;	/@ 12: General register R9	    @/
*    uint32_t r10;	/@ 13: General register R10	    @/
*    uint32_t r11;	/@ 14: General register R11	    @/
*    uint32_t r12;	/@ 15: General register R12	    @/
*    uint32_t r13;	/@ 16: General register R13	    @/
*
*    /@ emulated registers used by the VDK_SYS_ctx_load_vmmu system call    @/
*
*    uint32_t emsr;	/@ 17: emulated MSR register	        @/
*
*    /@ Debug control registers			        @/
*    
*    uint32_t     dbsr; /@ 18 - debug status register		    @/
*
*    /@ Debug control registers			        @/
*    
*    uint32_t     dbcr0; /@ 19 - debug control register 0	    @/
*    uint32_t     dbcr1; /@ 20 - debug control register 1	    @/
*    uint32_t     dbcr2; /@ 21 - debug control register 2	    @/
*
*    /@ instruction address compare registers IAC1-IAC2		    @/
*
*    uint32_t     iac1; /@ 22 - instructions access control 1	        @/
*    uint32_t     iac2; /@ 23 - instructions access control 2	        @/
*
*    /@ data address compare registers DAC1-DAC2.	        @/
*
*    uint32_t     dac1;	    /@ 24 - instructions access control 3       @/
*    uint32_t     dac2;	    /@ 25 - instructions access control 4       @/
*
*    /@ reserved fields for future use			    @/
*
*    uint32_t reserved[10]; /@ 26: Reserved		    @/ 
*    } VB_ARCH_CONTROL_REGS;
*
*\ce
*
* SEE ALSO: VB_ARCH_CONTROL_REGS, architecture supplement document 
*\COMMAND
*\NOMANUAL
*/

typedef struct vbArchControlRegs
    {

    /* Registers to be restored by the VDK_SYS_ctx_load fast system call */

    uint32_t srr0;		/*  0: PC */
    uint32_t srr1;		/*  1: MSR */
    uint32_t cr;		/*  2: condition registers */
    uint32_t r0;		/*  3: General register R0 */
    uint32_t sp;		/*  4: General register R1 (stack pointer) */
    uint32_t r2;		/*  5: General register R2 */
    uint32_t r3;		/*  6: General register R3 */
    uint32_t r4;		/*  7: General register R4 */
    uint32_t r5;		/*  8: General register R5 */
    uint32_t r6;		/*  9: General register R6 */
    uint32_t r7;		/* 10: General register R7 */
    uint32_t r8;		/* 11: General register R8 */
    uint32_t r9;		/* 12: General register R9 */
    uint32_t r10;		/* 13: General register R10 */
    uint32_t r11;		/* 14: General register R11 */
    uint32_t r12;		/* 15: General register R12 */
    uint32_t r13;		/* 16: General register R13 */

    /* emulated registers used by the VDK_SYS_ctx_load_vmmu system call */

    uint32_t emsr;		/* 17: emulated MSR register */

    /* Debug control registers */
    
    uint32_t     dbsr; /* 18 - debug status register */

    /* Debug control registers */
    
    uint32_t     dbcr0; /* 19 - debug control register 0 */
    uint32_t     dbcr1; /* 20 - debug control register 1 */
    uint32_t     dbcr2; /* 21 - debug control register 2 */

    /* instruction address compare registers IAC1-IAC2 */

    uint32_t     iac1; /* 22 - instructions access control 1 */
    uint32_t     iac2; /* 23 - instructions access control 2 */

    /* data address compare registers DAC1-DAC2. */

    uint32_t     dac1; /* 24 - instructions access control 3 */
    uint32_t     dac2; /* 25 - instructions access control 4 */
#if (CPU==PPC85XX)
    uint32_t     spefscr; /* 26 - SPE float status control */
#else
    uint32_t     reserved1;       /* 26: Reserved */
#endif
    uint32_t     asid;    /* 27 - Emulated ASID */
    uint32_t     vmmuHandle;    /* 28 - vmmuHandle */
    /* reserved fields for future use */

    uint32_t reserved[7];       /* 29: Reserved */
    } VB_ARCH_CONTROL_REGS;

/*******************************************************************************
*
* VB_ARCH_STATUS_REGS - Virtual core PPC emulated status registers
*
* Virtual board emulated CPU status registers
*
* SYNOPSIS
*
* PPC Status structure graphical illustration
*\cs
*        _______________   ---------------------------
*       |    SRR0       |   
*       |---------------|
*       |    SRR1       |   Registers save by WRHV	
*       |---------------|   before injecting an exception/interrupt
*       |    CR		|
*       |---------------|
*       |    LR		|
*       |---------------|
*       |    r3		| 
*       |---------------|
*       |    r4         |
*       |---------------|   ---------------------------
*	|    mcsrr0	|	
*       |---------------|  Registers saved during exception handling
*       |    mcssr1     |
*       |---------------|
*       |    esr        |
*       |---------------|
*       |    mcsr       |
*       |---------------|
*       |    mcar       |
*       |---------------|
*       |    dear       |
*       |---------------|
*       |    emsr       |
*       |---------------|
*       |    esrr0      |
*       |---------------|
*       |    esrr1      |
*       |---------------|    -------------------------
*       | reserved[8]   |      8 x 32bits for future enhancements
*       |---------------|    -------------------------
*       |    svr        |
*       |---------------|
*       |    pir        |
*       |---------------|
*       |    pvr        |    Configuration registers updated
*       |---------------|    upon board creation    
*       |    hid0       |  
*       |---------------|
*       |    hid1       |
*       |---------------|
*       |    buscr      |
*       |---------------|       
*       |    l1csr0     |
*       |---------------|
*       |    l1csr1     |
*       |---------------|   --------------------------
*       | reserved[0:8] | 9x 32bit
*       |---------------|
*
*\ce
*
* Virtual core's status C data structure type definition
*
*\cs
* VB_ARCH_STATUS_REGS structure definition
*
* typedef struct archStatusRegs
*    {
*
*    /@ 
*     @ registers saved by WRHV for all interrupts exceptions
*     @ before setting the PC in the virtual board to the exception/interrupt
*     @ vector address
*     @/
*
*    uint32_t srr0; /@ 0: PC at time of the interrupt		@/
*    uint32_t srr1; /@ 1: MSR at time of the interrupt		@/
*    uint32_t cr;   /@ 2: Condition registers at time of the interrupt	@/
*    uint32_t lr;   /@ 3: Link register at time of the interrupt    @/
*    uint32_t r3;   /@ 4: R3 at time of the interrupt		@/
*    uint32_t r4;   /@ 5: R4 at time of the interrupt		@/
*
*    /@ Registers saved by WRHV during exception processing only    @/
*
*    uint32_t mcsrr0; /@  6:			    @/
*    uint32_t mcsrr1; /@  7:			    @/
*    uint32_t esr;    /@  8:			    @/
*    uint32_t mcsr;   /@  9:			    @/
*    uint32_t mcar;   /@ 10			@/
*    uint32_t dear;   /@ 11:			    @/
*    uint32_t emsr;   /@ 12:			    @/
*    uint32_t esrr0;  /@ 13:			    @/
*    uint32_t esrr1;  /@ 14:			    @/
*
*    /@ reserved fields for future use			@/
*
*    uint32_t reserved1[8]; /@ 15 - 22			@/
*
*    /@ Configuration registers (only updated upon board creation   @/
*
*    uint32_t svr;     /@ 23			    @/     
*    uint32_t pir;     /@ 24			    @/
*    uint32_t pvr;     /@ 25			    @/  
*    uint32_t hid0;    /@ 26			    @/
*    uint32_t hid1;    /@ 27			    @/
*    uint32_t bucsr;   /@ 28			    @/
*    uint32_t l1csr0;  /@ 29			    @/
*    uint32_t l1csr1;  /@ 30			    @/
*    
*    /@ reserved fields for future use			@/
*
*    uint32_t reserved2[9]; /@ 31 - 39			@/
*
*    } VB_ARCH_STATUS_REGS; 
*
*
*\ce
*
* SEE ALSO: VB_STATUS 
*\COMMAND
*\NOMANUAL
*/

typedef struct archStatusRegs
    {

    /* 
     * registers saved by WRHV for all interrupts exceptions
     * before setting the PC in the virtual board to the exception/interrupt
     * vector address
     */

    uint32_t srr0; /* 0: PC at time of the interrupt */
    uint32_t srr1; /* 1: MSR at time of the interrupt */
    uint32_t cr;   /* 2: Condition registers at time of the interrupt */
    uint32_t lr;   /* 3: Link register at time of the interrupt */
    uint32_t r3;   /* 4: R3 at time of the interrupt */
    uint32_t r4;   /* 5: R4 at time of the interrupt */

    /* Registers saved by WRHV during exception processing only */

    uint32_t mcsrr0; /*  6: */
    uint32_t mcsrr1; /*  7: */
    uint32_t esr;    /*  8: */
    uint32_t mcsr;   /*  9: */
    uint32_t mcar;   /* 10  */
    uint32_t dear;   /* 11: */
    uint32_t emsr;   /* 12: */
    uint32_t esrr0;  /* 13: */
    uint32_t esrr1;  /* 14: */
#if (CPU==PPC85XX)
    uint32_t spefscr;  /* 15: */
#else
    uint32_t reserved1; /* 15  */
#endif
    uint32_t asid;     /* 16: */
    uint32_t vmmuHandle; /* 17 */
/* 
 * keep this part in a separate structure in order to keep the offsets
 * to remain the same as in VB_STATUS
 */

    /* reserved fields for future use */

    uint32_t reserved2[5]; /* 18 - 22  */

    /* Configuration registers (only updated upon board creation */

    uint32_t svr;     /* 23 */     
    uint32_t pir;     /* 24 */
    uint32_t pvr;     /* 25 */  
    uint32_t hid0;    /* 26 */
    uint32_t hid1;    /* 27 */
    uint32_t bucsr;   /* 28 */
    uint32_t l1csr0;  /* 29 */
    uint32_t l1csr1;  /* 30 */
    
    /* reserved fields for future use */

    uint32_t reserved3[9]; /* 31 - 39 */

    } VB_ARCH_STATUS_REGS; 


/*******************************************************************************
*
* VBI_HREG_SET - hardware register set, for read/write
*
* Used by vbiVbRegisterRead/vbiVbRegisterWrite to read/write registers in 
* another VB
* 
* SYNOPSIS
*
* VB hardware register set C data structure type definition
*
*\cs
*
* typedef struct
*     {
*     uint32_t gpr[GREG_NUM];	/@ general purpose registers @/
*     uint32_t msr;		/@ machine state register @/
*     uint32_t lr;		/@ link register @/
*     uint32_t ctr;		/@ count register @/
*     uint32_t pc;		/@ program counter @/
*     uint32_t cr;		/@ condition register @/
*     uint32_t xer;		/@ fixed-point exception register @/
*     uint32_t spefscr;		/@ SPE floating-point status & ctrl reg @/
*     uint32_t casid;		/@ PPC405, Book E PID and PPC860 M_CASID @/
*     } VBI_HREG_SET;
* 
*
*\ce
* SEE ALSO: NONE
* 
*\NOMANUAL
* 
*/

